# Ramadan Abdunabi
## Week13 4/09/2024
### Python - Pandas Series and DataFrame

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
print(pd.__version__)

1.0.5

# Panda Series

What is a Series?
A Pandas Series is like a column in a table.

It is a one-dimensional array holding data of any type.

In [3]:
s = Series([2,5,7,-9,8,4])

s

0    2
1    5
2    7
3   -9
4    8
5    4
dtype: int64

In [4]:
'''
Labels
If nothing else is specified, the values are labeled with their index number. First value has index 0, 
second value has index 1 etc.

This label can be used to access a specified value.

'''
s.values

array([ 2,  5,  7, -9,  8,  4], dtype=int64)

In [5]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [6]:
#Return the first value of the Series:
print(s[1])

5

In [7]:
# Create Labels
# With the index argument, you can name your own labels. Label-based slicing

s = pd.Series( [10,20,30,40], index = ["w","x", "y", "z"] )

print(s)

w    10
x    20
y    30
z    40
dtype: int64

In [8]:
print(s["y"])

30

In [9]:
# creating series from numpy array
data = np.array(['a','b','c','d'])
s = pd.Series(data, index=[100,101,102,103] )
print(s)

100    a
101    b
102    c
103    d
dtype: object

In [10]:
# values and index
summer_olympic = Series( [2520,1122,937,847,713],index=['USA','Russia','Germany','UK','France'] )
summer_olympic

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [11]:
summer_olympic['USA']

2520

In [12]:
summer_olympic[summer_olympic>800]

USA        2520
Russia     1122
Germany     937
UK          847
dtype: int64

In [13]:
'USA' in summer_olympic

True

In [14]:
#Convert Series to dictionary - to dict()
summer_olympic_dict = summer_olympic.to_dict()

summer_olympic_dict

{'USA': 2520, 'Russia': 1122, 'Germany': 937, 'UK': 847, 'France': 713}

In [15]:
#Convert dictionary to Series
summer_olympic_Series = Series(summer_olympic_dict)
summer_olympic_Series

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [16]:
countries = ['Russia','France','Spain','Germany','USA','UK','Italy']

In [17]:
# Redefine a Series
s2 = Series(summer_olympic_dict,index=countries)

s2

Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [18]:
pd.isnull(s2)

Russia     False
France     False
Spain       True
Germany    False
USA        False
UK         False
Italy       True
dtype: bool

In [19]:
pd.notnull(s2)

Russia      True
France      True
Spain      False
Germany     True
USA         True
UK          True
Italy      False
dtype: bool

In [20]:
summer_olympic_Series

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [21]:
s2

Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [22]:
summer_olympic_Series + s2

France     1426.0
Germany    1874.0
Italy         NaN
Russia     2244.0
Spain         NaN
UK         1694.0
USA        5040.0
dtype: float64

In [23]:
#change the name
s2.name="Summer Olympic"

In [24]:
s2

Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
Name: Summer Olympic, dtype: float64

In [25]:
s2.index.name='Countries'

In [26]:
s2

Countries
Russia     1122.0
France      713.0
Spain         NaN
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
Name: Summer Olympic, dtype: float64

## What is a DataFrame?

**A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.**

In [27]:
# Iqnore
# creat dataframe from a dictionary
mydataset = {
  'cars': ["GMC", "Toyota", "Ford"],
  'seats': [8, 7, 5]
}

myvar = pd.DataFrame(mydataset)

print(myvar)

     cars  seats
0     GMC      8
1  Toyota      7
2    Ford      5

In [28]:
# Create a simple Pandas DataFrame:
data = {
  "calories": [420, 380, 390],
  "fruits": ['Orange','Banana', 'Grape']
}

#load data into a DataFrame object:
df = pd.DataFrame(data)

print(df)

   calories  fruits
0       420  Orange
1       380  Banana
2       390   Grape

In [29]:
df.describe

<bound method NDFrame.describe of    calories  fruits
0       420  Orange
1       380  Banana
2       390   Grape>

In [30]:
df.info

<bound method DataFrame.info of    calories  fruits
0       420  Orange
1       380  Banana
2       390   Grape>

In [31]:
# Locate Row

#As you can see from the result above, the DataFrame is like a table with rows and columns.

#Pandas use the loc attribute to return one or more specified row(s)

#Example: Return row 0:

#refer to the row index:

#Note: This example returns a Pandas Series.
print(df.loc[0])

calories       420
fruits      Orange
Name: 0, dtype: object

In [32]:
#Note: This example returns a Pandas Series.
d = df.loc[0]
type(d)

pandas.core.series.Series

In [33]:
#Return row 0 and 1:

#use a list of indexes:
# Note: When using [], the result is a Pandas DataFrame.
print(df.loc[[0, 1]])

   calories  fruits
0       420  Orange
1       380  Banana

In [34]:
# Note: When using [], the result is a Pandas DataFrame.
d = df.loc[[0, 1]]
type(d)

pandas.core.frame.DataFrame

In [35]:
#DataFrame

data_dict = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
            'year': [2000, 2001, 2002, 2001, 2002, 2003],
             'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

df = pd.DataFrame(data_dict)

df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [36]:
df.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [37]:
df.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [38]:
# reorder the columns
pd.DataFrame(data_dict, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [39]:
df2 = pd.DataFrame(data_dict, columns=['year','state','pop','debt'], 
            index=['one', 'two', 'three', 'four','five', 'six'])

df2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [40]:
df2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [41]:
df2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [42]:
df2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [43]:
df2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [44]:
d = df2.loc['three']
type(d)

pandas.core.series.Series

In [45]:
# add a new columns 
df2['debt'] = 10.5

df2

       year   state  pop  debt
one    2000    Ohio  1.5  10.5
two    2001    Ohio  1.7  10.5
three  2002    Ohio  3.6  10.5
four   2001  Nevada  2.4  10.5
five   2002  Nevada  2.9  10.5
six    2003  Nevada  3.2  10.5

In [46]:
# adding a new column 
df2['debt'] = np.arange(6.)

df2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [47]:
# Assign a series values to one of the data frame columns 
s3 = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [48]:
s3

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [49]:
df2['debt']= s3
df2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [50]:
df2['eastren'] = df2['state'] == 'Ohio'
df2

       year   state  pop  debt  eastren
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [51]:
df2.columns

Index(['year', 'state', 'pop', 'debt', 'eastren'], dtype='object')

In [52]:
# delete column
del df2['eastren']
df2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [53]:
import pandas as pd
from pandas import *

In [54]:
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'San Francisco', 'Los Angeles']}
df = pd.DataFrame(data)
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [55]:
df[df['Age'] > 25]

      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [56]:
#nested dictionary, as you can see a dictionary that has another dictionary inside it, 
#it names the lable, using the nested dictionary. 

pop_dict = {'Nevada': {2001: 2.4, 2002: 2.9},
           'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}} 

pop_dict

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [57]:
df3 = pd.DataFrame(pop_dict)

df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [58]:
df3.T # changing rows to columns

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [59]:
DataFrame(df3,index=[2001,2002,2003]) # one index is missing

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [60]:
df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [61]:
df3['Ohio']

2001    1.7
2002    3.6
2000    1.5
Name: Ohio, dtype: float64

In [62]:
df3['Ohio'][:2]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [63]:
df3['Ohio'][:-1]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [64]:
df3['Nevada'][:1]

2001    2.4
Name: Nevada, dtype: float64

In [65]:
#  set ndex and columns their name attributes
df3.index.name= 'year'; df3.columns.name = 'state'

df3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [66]:
data = {
  "calories": [420, 380, 390],
  "fruits": ['Apple', 'Cherry', 'Banana']
}

df = pd.DataFrame(data, index = ["day1", "day2", "day3"])

print(df)

      calories  fruits
day1       420   Apple
day2       380  Cherry
day3       390  Banana

In [67]:
# Use the named index in the loc attribute to return the specified row(s).
print(df.loc["day2"])

calories       380
fruits      Cherry
Name: day2, dtype: object